{
  "presentations": [
    {
      "id": "presentation-builder-vancouver-intro",
      "title": "Welcome to Builder Vancouver",
      "slug": "builder-vancouver-intro",
      "description": "A comprehensive introduction to Builder Vancouver, covering what Builder is, why Vancouver is a great Bitcoin builder city, and what to expect at meetups.",
      "overview": "This presentation serves as the opening session for Builder Vancouver's first event. We'll introduce attendees to the Builder movement, explain our mission and vision, explore why Vancouver is an exceptional Bitcoin builder city, and outline what to expect at our meetups. Perfect for newcomers and existing community members alike.",
      "presenterId": "presenter-builder-vancouver-organizer",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-02-15",
      "duration": "30-45 minutes",
      "links": [
        {
          "text": "Builder Vancouver Website",
          "url": "https://builder.van",
          "external": true
        },
        {
          "text": "Bitcoin 101 Guide",
          "url": "/bitcoin-101",
          "external": false
        },
        {
          "text": "What to Expect",
          "url": "/what-to-expect",
          "external": false
        }
      ],
      "slideDeckSlug": "builder-vancouver-intro",
      "sections": [
        {
          "title": "What is Builder?",
          "body": "Builder is a community-driven movement focused on accelerating Bitcoin product development. We bring together developers, designers, and builders to learn practical Bitcoin skills, share knowledge and tools, build real products together, and foster sovereignty through better UX."
        },
        {
          "title": "Our Mission and Vision",
          "body": "Our mission is to accelerate the creation of Bitcoin products by fostering an open, neutral, sovereign, and collaborative builder ecosystem. Our vision is a world where Bitcoin builders have the tools, knowledge, and community to create the next generation of open financial products."
        },
        {
          "title": "Why Vancouver?",
          "body": "Vancouver is one of the most Bitcoin-friendly cities in North America, with a vibrant builder community, over 100 Lightning-enabled merchants, and a deep culture of experimentation and sovereignty. The local ecosystem benefits from strong tech talent, established Bitcoin meetups, and a culture that values privacy and open digital systems."
        },
        {
          "title": "What to Expect",
          "body": "Our meetups typically run 2-3 hours and include presentations, hands-on activities, and networking. We start with introductions, followed by the main content, and end with open discussion and collaboration time. Expect a casual, friendly environment focused on learning and building."
        }
      ],
      "meta": {
        "title": "Welcome to Builder Vancouver | Builder Vancouver",
        "description": "A comprehensive introduction to Builder Vancouver, covering what Builder is, why Vancouver is a great Bitcoin builder city, and what to expect at meetups.",
        "keywords": [
          "builder",
          "vancouver",
          "bitcoin",
          "introduction",
          "meetup",
          "community"
        ]
      }
    },
    {
      "id": "presentation-vibe-coding-builder-2025",
      "title": "Vibe Coding the Builder Resource Center",
      "slug": "vibe-coding-builder-workflow",
      "description": "How the Builder Ops Team uses structured content, ChatGPT, and Cursor Agents to ship Bitcoin education faster.",
      "overview": "Builder treats vibe coding as an educational engine. This presentation walks through how the team turns loose ideas into structured content blocks, ships them through a Next.js + Vercel pipeline, and keeps iterating with ChatGPT Projects and Cursor Agents—often from a phone. Attendees will see how education-first workflows create real value for the Bitcoin ecosystem while laying the groundwork for future decentralized features.",
      "presenterId": "presenter-builder-ops",
      "date": "2025-11-18",
      "duration": "30 minutes",
      "links": [
        {
          "text": "Cursor",
          "url": "https://cursor.sh",
          "external": true
        },
        {
          "text": "ChatGPT Projects",
          "url": "https://openai.com/chatgpt",
          "external": true
        },
        {
          "text": "Vercel",
          "url": "https://vercel.com",
          "external": true
        },
        {
          "text": "Structured Content Primer",
          "url": "https://www.contentful.com/blog/what-is-structured-content/",
          "external": true
        }
      ],
      "slidesUrl": "https://builder.van/slides/vibe-coding-builder",
      "sections": [
        {
          "title": "Education as Bitcoin Value",
          "body": "The Builder Ops Team frames vibe coding as an education multiplier. Every guide, FAQ, or slide deck removes friction for the next contributor, so the first priority is building a resource center that anyone can remix. By keeping the spotlight on education, Builder turns documentation into a product that compounds value for the ecosystem."
        },
        {
          "title": "Structured Content Everywhere",
          "body": "Instead of copy-pasting prose, Builder breaks information into small JSON structures. Those blocks power the website today and can be piped into mobile apps, newsletters, or agent prompts tomorrow. ChatGPT sessions always end by distilling insights straight into schema-friendly snippets so future surfaces can re-use the same source of truth."
        },
        {
          "title": "ChatGPT + Cursor Workflow",
          "body": "ChatGPT Pro (with Projects) is the vibe planning space where documents live, questions get answered, and next steps emerge. Cursor Pro keeps build momentum high with AI pair programming, rapid refactors, and the new Agents feature for parallel work—even from a phone. Code flows into GitHub, deploys to Vercel previews, and returns with feedback in minutes."
        },
        {
          "title": "Roadmap to Decentralized Features",
          "body": "With the content MVP live, the next moves are clear: ship a backend to edit structured content on the fly, expose the data so other services can subscribe to Builder knowledge, and layer in more Bitcoin-native features like Lightning, Nostr, and decentralization primitives. The same vibe coding habits will power each milestone."
        }
      ],
      "meta": {
        "title": "Vibe Coding the Builder Resource Center | Builder Vancouver",
        "description": "Presentation covering how Builder uses structured content, ChatGPT, Cursor, and Vercel to deliver Bitcoin education and prepare for decentralized features.",
        "keywords": [
          "vibe coding",
          "structured content",
          "chatgpt",
          "cursor",
          "bitcoin education",
          "builder"
        ]
      }
    },
    {
      "id": "presentation-spiral-bitcoin-merchant-community",
      "title": "Spiral.xyz and the Bitcoin Merchant Community Website",
      "slug": "spiral-bitcoin-merchant-community",
      "description": "An exploration of Spiral.xyz's mission and infrastructure, plus the story behind the Bitcoin Merchant Community Website—how it came to life and what it means for Bitcoin commerce.",
      "overview": "Mat Balez presents a comprehensive overview of Spiral.xyz, covering everything Spiral does to support Bitcoin and Lightning infrastructure. The presentation also dives deep into the Bitcoin Merchant Community Website project, sharing the origin story of how this initiative came to life and its impact on the Bitcoin merchant ecosystem.",
      "presenterId": "presenter-mat-balez",
      "date": "2025-01-15",
      "duration": "45 minutes",
      "links": [
        {
          "text": "Spiral.xyz",
          "url": "https://spiral.xyz",
          "external": true
        },
        {
          "text": "Bitcoin Merchant Community Website",
          "url": "https://www.bitcoinmerchantcommunity.org/",
          "external": true
        }
      ],
      "sections": [
        {
          "title": "What is Spiral.xyz?",
          "body": "Spiral.xyz is a non-profit organization dedicated to advancing Bitcoin and Lightning Network infrastructure. Spiral provides open-source tools, developer resources, and support for teams building Bitcoin-native applications. The organization focuses on creating polished user experiences powered by open-source infrastructure, helping developers ship production-ready Bitcoin and Lightning products."
        },
        {
          "title": "Spiral's Core Mission",
          "body": "Spiral's mission centers on making Bitcoin and Lightning development more accessible and practical. By providing robust infrastructure, comprehensive documentation, and developer support, Spiral enables teams to focus on building great user experiences rather than wrestling with low-level Bitcoin protocol details. The organization champions open-source principles and sovereignty-first approaches to financial technology."
        },
        {
          "title": "What Spiral Does",
          "body": "Spiral provides a comprehensive suite of tools and services for Bitcoin builders. This includes open-source libraries and SDKs for Bitcoin and Lightning integration, developer documentation and educational resources, community support and collaboration opportunities, and infrastructure components that abstract away Bitcoin protocol complexity. Spiral also maintains and contributes to critical Bitcoin open-source projects, ensuring the ecosystem has reliable, well-maintained building blocks."
        },
        {
          "title": "The Bitcoin Merchant Community Website",
          "body": "The Bitcoin Merchant Community Website (bitcoinmerchantcommunity.org) serves as a central hub for merchants accepting Bitcoin and Lightning payments. The platform helps merchants discover each other, share best practices, and showcase their Bitcoin adoption. It provides a directory of Bitcoin-accepting businesses, resources for merchants getting started with Bitcoin payments, and a community space for collaboration and knowledge sharing."
        },
        {
          "title": "How the Project Came to Life",
          "body": "The Bitcoin Merchant Community Website emerged from recognizing a gap in the Bitcoin ecosystem: while merchants were adopting Bitcoin payments, there was no centralized place for them to connect, learn, and grow together. The project started with conversations about the challenges merchants face—from technical integration to customer education—and evolved into a vision for a community-driven platform. Through collaboration with merchants, developers, and the broader Bitcoin community, the website took shape as both a practical tool and a symbol of Bitcoin commerce growth."
        },
        {
          "title": "Impact and Vision",
          "body": "The Bitcoin Merchant Community Website represents more than just a directory—it's a movement toward stronger Bitcoin commerce networks. By connecting merchants and providing resources, the platform helps accelerate Bitcoin adoption at the point of sale. The vision extends to creating a thriving ecosystem where merchants can easily accept Bitcoin, customers can easily spend it, and the entire network grows stronger through community collaboration and shared knowledge."
        }
      ],
      "meta": {
        "title": "Spiral.xyz and the Bitcoin Merchant Community Website | Builder Vancouver",
        "description": "Mat Balez presents Spiral.xyz's mission and infrastructure, plus the story behind the Bitcoin Merchant Community Website—how it came to life and what it means for Bitcoin commerce.",
        "keywords": [
          "spiral",
          "bitcoin merchant",
          "lightning network",
          "bitcoin commerce",
          "infrastructure",
          "open source",
          "bitcoin payments"
        ]
      }
    }
  ]
}
