{
  "presentations": [
    {
      "id": "presentation-event-kickoff",
      "title": "Event Kickoff & Housekeeping",
      "slug": "event-kickoff-housekeeping",
      "description": "Welcome and housekeeping for Builder Vancouver's launch event, including agenda overview and community guidelines.",
      "overview": "A friendly welcome presentation to kick off Builder Vancouver's launch event. We'll thank everyone for coming, acknowledge our host Funk Coffee, go over housekeeping rules, discuss the evening's agenda, and establish our community guidelines for respectful and productive discussion.",
      "presenterId": "presenter-justin-ohalloran",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "duration": "5-10 minutes",
      "sections": [
        {
          "title": "Welcome & Thank You",
          "body": "Thank you all for coming out tonight! We're thrilled to have you here for Builder Vancouver's launch event. A special thank you to Funk Coffee for hosting us and providing this wonderful space. We're grateful for their support of the Bitcoin builder community in Vancouver."
        },
        {
          "title": "Housekeeping",
          "body": "A few quick housekeeping items: please help yourself to pizza and refreshments, and if you have any questions or need anything, feel free to ask any of the organizers."
        },
        {
          "title": "Tonight's Agenda",
          "body": "Here's what we have planned for the evening: We'll start with a brief introduction to Builder Vancouver, followed by six lightning presentations covering Spiral, Nostr, the Bepsi Machine, Bitpoints.me, and Vibe Coding. After the presentations, we'll dive into news topics discussion, and then open the floor for questions and topic suggestions."
        },
        {
          "title": "Community Guidelines: We're All Learning",
          "body": "First and foremost, remember that no one here is an expert—we're all trying our best. We're all on different parts of our Bitcoin journey, and that's what makes this community valuable. If you want to correct someone or add additional context, please find time to do so after the event. This keeps our discussions flowing smoothly and ensures everyone feels comfortable participating."
        },
        {
          "title": "Questions During Presentations",
          "body": "During the presentations, we ask that you hold your questions until after each presentation is finished. This ensures the presenter can stay on track and cover all their material. We'll have dedicated Q&A time after all presentations, and we'll also open the floor for discussion towards the end of the event."
        },
        {
          "title": "Open Discussion Time",
          "body": "Towards the end of the event, we'll open the floor up for questions and discussion. This is your chance to dive deeper into topics, share your thoughts, and connect with fellow builders. We want to hear from you!"
        },
        {
          "title": "A Safe Space for Learning",
          "body": "This is a safe space for open discussion and dialogue. There are no dumb questions—we're all approaching Bitcoin from different angles, with different backgrounds and levels of experience. Whether you're a seasoned developer or just curious about Bitcoin, your perspective is valuable. Let's learn from each other and build together."
        }
      ],
      "meta": {
        "title": "Event Kickoff & Housekeeping | Builder Vancouver",
        "description": "Welcome and housekeeping for Builder Vancouver's launch event, including agenda overview and community guidelines.",
        "keywords": [
          "builder",
          "vancouver",
          "bitcoin",
          "kickoff",
          "housekeeping",
          "community",
          "guidelines"
        ]
      }
    },
    {
      "id": "presentation-builder-vancouver-intro",
      "title": "Welcome to Builder Vancouver",
      "slug": "builder-vancouver-intro",
      "description": "A comprehensive introduction to Builder Vancouver, covering what Builder is, why Vancouver is a great Bitcoin builder city, and what to expect at meetups.",
      "overview": "This presentation serves as the opening session for Builder Vancouver's first event. We'll introduce attendees to the Builder movement, explain our mission and vision, explore why Vancouver is an exceptional Bitcoin builder city, and outline what to expect at our meetups. Perfect for newcomers and existing community members alike.",
      "presenterId": "presenter-builder-vancouver-organizer",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "duration": "30-45 minutes",
      "links": [
        {
          "text": "Builder Vancouver Website",
          "url": "https://builder.van",
          "external": true
        },
        {
          "text": "Bitcoin 101 Guide",
          "url": "/bitcoin-101",
          "external": false
        },
        {
          "text": "What to Expect",
          "url": "/what-to-expect",
          "external": false
        }
      ],
      "slideDeckSlug": "builder-vancouver-intro",
      "sections": [
        {
          "title": "What is Builder?",
          "body": "Builder is a community-driven movement focused on accelerating Bitcoin product development. We bring together developers, designers, and builders to learn practical Bitcoin skills, share knowledge and tools, build real products together, and foster sovereignty through better UX."
        },
        {
          "title": "Our Mission and Vision",
          "body": "Our mission is to accelerate the creation of Bitcoin products by fostering an open, neutral, sovereign, and collaborative builder ecosystem. Our vision is a world where Bitcoin builders have the tools, knowledge, and community to create the next generation of open financial products."
        },
        {
          "title": "Why Vancouver?",
          "body": "Vancouver is one of the most Bitcoin-friendly cities in North America, with a vibrant builder community, over 100 Lightning-enabled merchants, and a deep culture of experimentation and sovereignty. The local ecosystem benefits from strong tech talent, established Bitcoin meetups, and a culture that values privacy and open digital systems."
        },
        {
          "title": "What to Expect",
          "body": "Our meetups typically run 2-3 hours and include presentations, hands-on activities, and networking. We start with introductions, followed by the main content, and end with open discussion and collaboration time. Expect a casual, friendly environment focused on learning and building."
        }
      ],
      "meta": {
        "title": "Welcome to Builder Vancouver | Builder Vancouver",
        "description": "A comprehensive introduction to Builder Vancouver, covering what Builder is, why Vancouver is a great Bitcoin builder city, and what to expect at meetups.",
        "keywords": [
          "builder",
          "vancouver",
          "bitcoin",
          "introduction",
          "meetup",
          "community"
        ]
      }
    },
    {
      "id": "presentation-vibe-coding-builder-2025",
      "title": "Vibe Coding the Builder Resource Center",
      "slug": "vibe-coding-builder-workflow",
      "description": "How the Builder Ops Team uses structured content, ChatGPT, and Cursor Agents to ship Bitcoin education faster.",
      "overview": "Builder treats vibe coding as an educational engine. This presentation walks through how the team turns loose ideas into structured content blocks, ships them through a Next.js + Vercel pipeline, and keeps iterating with ChatGPT Projects and Cursor Agents—often from a phone. Attendees will see how education-first workflows create real value for the Bitcoin ecosystem while laying the groundwork for future decentralized features.",
      "presenterId": "presenter-builder-ops",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "duration": "30 minutes",
      "links": [
        {
          "text": "Cursor",
          "url": "https://cursor.sh",
          "external": true
        },
        {
          "text": "ChatGPT Projects",
          "url": "https://openai.com/chatgpt",
          "external": true
        },
        {
          "text": "Vercel",
          "url": "https://vercel.com",
          "external": true
        },
        {
          "text": "Structured Content Primer",
          "url": "https://www.contentful.com/blog/what-is-structured-content/",
          "external": true
        }
      ],
      "slidesUrl": "https://builder.van/slides/vibe-coding-builder",
      "sections": [
        {
          "title": "Education as Bitcoin Value",
          "body": "The Builder Ops Team frames vibe coding as an education multiplier. Every guide, FAQ, or slide deck removes friction for the next contributor, so the first priority is building a resource center that anyone can remix. By keeping the spotlight on education, Builder turns documentation into a product that compounds value for the ecosystem."
        },
        {
          "title": "Structured Content Everywhere",
          "body": "Instead of copy-pasting prose, Builder breaks information into small JSON structures. Those blocks power the website today and can be piped into mobile apps, newsletters, or agent prompts tomorrow. ChatGPT sessions always end by distilling insights straight into schema-friendly snippets so future surfaces can re-use the same source of truth."
        },
        {
          "title": "ChatGPT + Cursor Workflow",
          "body": "ChatGPT Pro (with Projects) is the vibe planning space where documents live, questions get answered, and next steps emerge. Cursor Pro keeps build momentum high with AI pair programming, rapid refactors, and the new Agents feature for parallel work—even from a phone. Code flows into GitHub, deploys to Vercel previews, and returns with feedback in minutes."
        },
        {
          "title": "Roadmap to Decentralized Features",
          "body": "With the content MVP live, the next moves are clear: ship a backend to edit structured content on the fly, expose the data so other services can subscribe to Builder knowledge, and layer in more Bitcoin-native features like Lightning, Nostr, and decentralization primitives. The same vibe coding habits will power each milestone."
        }
      ],
      "meta": {
        "title": "Vibe Coding the Builder Resource Center | Builder Vancouver",
        "description": "Presentation covering how Builder uses structured content, ChatGPT, Cursor, and Vercel to deliver Bitcoin education and prepare for decentralized features.",
        "keywords": [
          "vibe coding",
          "structured content",
          "chatgpt",
          "cursor",
          "bitcoin education",
          "builder"
        ]
      }
    },
    {
      "id": "presentation-spiral-bitcoin-merchant-community",
      "title": "Spiral.xyz and the Bitcoin Merchant Community Website",
      "slug": "spiral-bitcoin-merchant-community",
      "description": "An exploration of Spiral.xyz's mission and infrastructure, plus the story behind the Bitcoin Merchant Community Website—how it came to life and what it means for Bitcoin commerce.",
      "overview": "Mat Balez presents a comprehensive overview of Spiral.xyz, covering everything Spiral does to support Bitcoin and Lightning infrastructure. The presentation also dives deep into the Bitcoin Merchant Community Website project, sharing the origin story of how this initiative came to life and its impact on the Bitcoin merchant ecosystem.",
      "presenterId": "presenter-mat-balez",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "duration": "45 minutes",
      "links": [
        {
          "text": "Spiral.xyz",
          "url": "https://spiral.xyz",
          "external": true
        },
        {
          "text": "Bitcoin Merchant Community Website",
          "url": "https://www.bitcoinmerchantcommunity.org/",
          "external": true
        }
      ],
      "sections": [
        {
          "title": "What is Spiral.xyz?",
          "body": "Spiral.xyz is a non-profit organization dedicated to advancing Bitcoin and Lightning Network infrastructure. Spiral provides open-source tools, developer resources, and support for teams building Bitcoin-native applications. The organization focuses on creating polished user experiences powered by open-source infrastructure, helping developers ship production-ready Bitcoin and Lightning products."
        },
        {
          "title": "Spiral's Core Mission",
          "body": "Spiral's mission centers on making Bitcoin and Lightning development more accessible and practical. By providing robust infrastructure, comprehensive documentation, and developer support, Spiral enables teams to focus on building great user experiences rather than wrestling with low-level Bitcoin protocol details. The organization champions open-source principles and sovereignty-first approaches to financial technology."
        },
        {
          "title": "What Spiral Does",
          "body": "Spiral provides a comprehensive suite of tools and services for Bitcoin builders. This includes open-source libraries and SDKs for Bitcoin and Lightning integration, developer documentation and educational resources, community support and collaboration opportunities, and infrastructure components that abstract away Bitcoin protocol complexity. Spiral also maintains and contributes to critical Bitcoin open-source projects, ensuring the ecosystem has reliable, well-maintained building blocks."
        },
        {
          "title": "The Bitcoin Merchant Community Website",
          "body": "The Bitcoin Merchant Community Website (bitcoinmerchantcommunity.org) serves as a central hub for merchants accepting Bitcoin and Lightning payments. The platform helps merchants discover each other, share best practices, and showcase their Bitcoin adoption. It provides a directory of Bitcoin-accepting businesses, resources for merchants getting started with Bitcoin payments, and a community space for collaboration and knowledge sharing."
        },
        {
          "title": "How the Project Came to Life",
          "body": "The Bitcoin Merchant Community Website emerged from recognizing a gap in the Bitcoin ecosystem: while merchants were adopting Bitcoin payments, there was no centralized place for them to connect, learn, and grow together. The project started with conversations about the challenges merchants face—from technical integration to customer education—and evolved into a vision for a community-driven platform. Through collaboration with merchants, developers, and the broader Bitcoin community, the website took shape as both a practical tool and a symbol of Bitcoin commerce growth."
        },
        {
          "title": "Impact and Vision",
          "body": "The Bitcoin Merchant Community Website represents more than just a directory—it's a movement toward stronger Bitcoin commerce networks. By connecting merchants and providing resources, the platform helps accelerate Bitcoin adoption at the point of sale. The vision extends to creating a thriving ecosystem where merchants can easily accept Bitcoin, customers can easily spend it, and the entire network grows stronger through community collaboration and shared knowledge."
        }
      ],
      "meta": {
        "title": "Spiral.xyz and the Bitcoin Merchant Community Website | Builder Vancouver",
        "description": "Mat Balez presents Spiral.xyz's mission and infrastructure, plus the story behind the Bitcoin Merchant Community Website—how it came to life and what it means for Bitcoin commerce.",
        "keywords": [
          "spiral",
          "bitcoin merchant",
          "lightning network",
          "bitcoin commerce",
          "infrastructure",
          "open source",
          "bitcoin payments"
        ]
      }
    },
    {
      "id": "presentation-martin-montero-nostr-vancouver",
      "title": "Nostr and Building Community in Vancouver",
      "slug": "nostr-building-community-vancouver",
      "description": "Martin Montero from Rabble Labs presents on Nostr and the community being built in Vancouver.",
      "overview": "Martin Montero presents on Nostr, a decentralized social protocol that pairs naturally with Bitcoin. The presentation explores how Nostr enables censorship-resistant social networking, integrates with Lightning payments for micropayments and tips, and how it's being used to build community in Vancouver. Attendees will learn about Nostr's architecture, its advantages over traditional social media, and how builders can leverage Nostr to create decentralized social and economic interactions.",
      "presenterId": "presenter-martin-montero",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "duration": "45 minutes",
      "links": [
        {
          "text": "Rabble Labs",
          "url": "https://www.rabblelabs.xyz/",
          "external": true
        },
        {
          "text": "Nostr Protocol",
          "url": "https://nostr.com/",
          "external": true
        },
        {
          "text": "Nostr News Topic",
          "url": "/news-topics/nostr-protocol-adoption",
          "external": false
        }
      ],
      "sections": [
        {
          "title": "What is Nostr?",
          "body": "Nostr (Notes and Other Stuff Transmitted by Relays) is a decentralized social protocol that enables censorship-resistant social networking. Unlike traditional social media platforms, Nostr operates on a relay-based architecture where users control their identity through cryptographic keys, and content is distributed through independent relay servers. This architecture ensures that no single entity can control or censor the network."
        },
        {
          "title": "Nostr's Architecture and Advantages",
          "body": "Nostr's relay architecture provides several key advantages over traditional social media. Users maintain full control of their identity through cryptographic keys, ensuring portability and sovereignty. The protocol is simple and extensible, allowing for rapid innovation. Most importantly, Nostr is censorship-resistant—since content flows through multiple independent relays, no single point of failure or control exists. This makes it ideal for communities that value free speech and decentralization."
        },
        {
          "title": "Lightning Integration and Micropayments",
          "body": "Nostr's native integration with Bitcoin Lightning Network enables seamless micropayments and tips. Users can send small payments directly through Nostr clients, creating new economic models for content creators and community builders. This integration makes Nostr particularly powerful for Bitcoin communities, as it combines decentralized social networking with decentralized payments in a single protocol."
        },
        {
          "title": "Building Community in Vancouver",
          "body": "Martin shares how Nostr is being used to build and strengthen the Bitcoin community in Vancouver. Through Rabble Labs' work, Nostr is helping connect Bitcoin builders, facilitate collaboration, and create new forms of community engagement. The presentation covers practical examples of how Nostr communities operate, how they differ from traditional social media groups, and how builders can leverage Nostr for their own projects."
        },
        {
          "title": "Privacy and Censorship Resistance",
          "body": "Nostr's design prioritizes privacy and censorship resistance. Users can choose which relays to use, implement encryption for private messages, and maintain pseudonymous identities. This makes Nostr particularly valuable for communities that face censorship or value privacy. The protocol's decentralized nature means that even if some relays are blocked or shut down, the network continues to function through other relays."
        },
        {
          "title": "Future of Decentralized Social",
          "body": "Nostr represents a new paradigm for social networking—one that aligns with Bitcoin's values of decentralization, sovereignty, and censorship resistance. As the protocol continues to evolve and gain adoption, it offers builders new opportunities to create social and economic interactions that aren't possible on traditional platforms. The presentation concludes with thoughts on how Nostr and Bitcoin together can reshape how communities connect and collaborate."
        }
      ],
      "meta": {
        "title": "Nostr and Building Community in Vancouver | Builder Vancouver",
        "description": "Martin Montero from Rabble Labs presents on Nostr and the community being built in Vancouver.",
        "keywords": [
          "nostr",
          "decentralized social",
          "lightning network",
          "bitcoin community",
          "censorship resistance",
          "vancouver",
          "rabble labs"
        ]
      }
    },
    {
      "id": "presentation-bepsi-machine-eric-chennels",
      "title": "The Bepsi Machine: Building a Bitcoin Vending Machine",
      "slug": "bepsi-machine-bitcoin-vending",
      "description": "Eric Chennells discusses the tools and techniques used to build the Bepsi machine—a Bitcoin vending machine—and how vibe coding accelerated the development process.",
      "overview": "Eric Chennells presents a deep dive into building the Bepsi machine, a Bitcoin vending machine that demonstrates practical Bitcoin and Lightning integration in a physical device. The presentation covers the hardware and software tools used in the project, the technical challenges encountered, and how vibe coding methodologies helped streamline development. Attendees will learn about the practical aspects of building Bitcoin-native hardware, the integration of Lightning payments, and how modern development workflows can accelerate Bitcoin product development.",
      "presenterId": "presenter-eric-chennels",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "duration": "30-45 minutes",
      "links": [
        {
          "text": "Vibe Coding Guide",
          "url": "/vibe-coding",
          "external": false
        }
      ],
      "slidesUrl": "https://docs.google.com/presentation/d/e/2PACX-1vTDt8lRiQdNFNaudd6YAFuMC_cGgudtl61X3f-Z5zIq6R7EGj3zRvh8TYKO2KkITvq6sfLpdWozxlyC/pub?start=true&loop=false&delayms=5000&slide=id.gc6f73a04f_0_0",
      "sections": [
        {
          "title": "Introducing the Bepsi Machine",
          "body": "The Bepsi machine is a Bitcoin vending machine that accepts Lightning payments for physical products. This project demonstrates how Bitcoin and Lightning can be integrated into everyday commerce, making Bitcoin spending tangible and accessible. The machine serves as both a practical tool and an educational demonstration of Bitcoin's real-world utility."
        },
        {
          "title": "Hardware and Tools",
          "body": "Building a Bitcoin vending machine requires careful selection of hardware components. Eric discusses the physical components used—from the vending mechanism itself to the computing hardware that powers the Bitcoin and Lightning integration. The presentation covers the trade-offs between different hardware options, cost considerations, and reliability requirements for a production-ready device."
        },
        {
          "title": "Software Stack and Integration",
          "body": "The software side of the Bepsi machine involves integrating Lightning payment processing with vending machine control systems. Eric walks through the software tools and libraries used to handle Lightning invoices, payment verification, and machine operation. This includes the Bitcoin and Lightning SDKs, payment processing workflows, and the interface between payment systems and physical hardware controls."
        },
        {
          "title": "Vibe Coding in Practice",
          "body": "Vibe coding played a crucial role in accelerating the Bepsi machine's development. Eric demonstrates how AI-assisted development workflows helped iterate quickly on payment integration, debug hardware-software interactions, and refine the user experience. The presentation shows how structured development approaches, combined with AI pair programming, enabled rapid prototyping and testing of Bitcoin payment flows."
        },
        {
          "title": "Challenges and Solutions",
          "body": "Building Bitcoin hardware presents unique challenges—from handling network connectivity issues to ensuring reliable payment processing. Eric shares the technical hurdles encountered during development and the solutions that emerged. This includes strategies for handling Lightning payment timeouts, managing offline scenarios, and ensuring the machine operates reliably in real-world conditions."
        },
        {
          "title": "Lessons Learned and Future Directions",
          "body": "The Bepsi machine project offers valuable insights into Bitcoin hardware development. Eric reflects on what worked well, what could be improved, and how the project informs future Bitcoin hardware initiatives. The presentation concludes with thoughts on how vibe coding and modern development tools can help more builders create Bitcoin-native products."
        }
      ],
      "meta": {
        "title": "The Bepsi Machine: Building a Bitcoin Vending Machine | Builder Vancouver",
        "description": "Eric Chennells discusses the tools and techniques used to build the Bepsi machine—a Bitcoin vending machine—and how vibe coding accelerated the development process.",
        "keywords": [
          "bepsi machine",
          "bitcoin vending machine",
          "lightning network",
          "bitcoin hardware",
          "vibe coding",
          "bitcoin payments",
          "hardware integration"
        ]
      }
    },
    {
      "id": "presentation-bitpoints-me",
      "title": "Introducing Bitpoints.me – A Bitcoin-native rewards system",
      "slug": "bitpoints-me",
      "description": "A Bitcoin-native rewards system born from a coffeeshop hobby project that transforms traditional loyalty points into sats, teaching people about Bitcoin through familiar UX patterns.",
      "overview": "JP shares the story of Bitpoints.me, a Bitcoin-native rewards system that started as a simple idea: give customers rewards at a local coffeeshop. Instead of airline miles or hotel points, JP wanted something better—something that teaches people about Bitcoin. The presentation covers how Bitpoints.me merges Cashu with Bitchat to create an interoperable, educational rewards platform where users see 'points' but behind the scenes they're 1:1 pegged to sats. Learn how this community-first, not corporate, system enables offline use for kids, offers discounts when paying with Points/sats, and creates a model where rewards gain value over time.",
      "presenterId": "presenter-jp",
      "eventId": "event-builder-vancouver-launch",
      "date": "2025-11-18",
      "links": [
        {
          "text": "Bitpoints.me",
          "url": "https://bitpoints.me",
          "external": true
        },
        {
          "text": "Cashu",
          "url": "https://cashu.me",
          "external": true
        },
        {
          "text": "btclearn.org",
          "url": "https://btclearn.org",
          "external": true
        },
        {
          "text": "nodeacademy.org",
          "url": "https://nodeacademy.org",
          "external": true
        }
      ],
      "sections": [
        {
          "title": "The Problem with Traditional Rewards",
          "body": "Everyone knows how to use points. But what they don't realize is: points get devalued in fiat terms, then they get devalued again by the issuer, and they're locked into platforms with zero interoperability. Traditional rewards systems like airline miles and hotel points are essentially the biggest shitcoins of all time—they lose value and trap users in closed ecosystems."
        },
        {
          "title": "The Coffeeshop Origin Story",
          "body": "It all started with a simple idea: give customers rewards at my local coffeeshop. But instead of airline miles or hotel points, I wanted something better—something that teaches people about Bitcoin. The question became: what if coffeeshop points were actually sats?"
        },
        {
          "title": "Enter Cashu",
          "body": "Cashu proved to be a perfect fit. Custodial? Sure. But so are all rewards systems. And for a coffeeshop, rugging users is bad business. So I forked cashu.me, rebranded it, and launched a quick PWA: points.trailscoffee.com. Users see 'points.' But behind the scenes, they're 1:1 pegged to sats. The mint shows sats. The wallet shows points. Simple UX. No friction. Just like a gift card—no login, just a code."
        },
        {
          "title": "Community Support and Development",
          "body": "Not a dev myself. I leaned heavily on nodeacademy.org and the amazing Vancouver-based Pacific Nodewest community. Their ideas, feedback, and support were invaluable. This project demonstrates how community collaboration can turn ideas into reality, even when you're not a traditional software developer."
        },
        {
          "title": "The Vision: Three Key Features",
          "body": "I wanted three things: offer a 10% discount when paying with Points/sats, create a model where rewards gain value over time (flipping the traditional system), and enable a way for local kids to use their points—without needing a phone. This required exploring new technical approaches beyond traditional mobile apps."
        },
        {
          "title": "Exploring Offline Solutions",
          "body": "I explored Bolt Cards. Cool tech, but still phone-dependent. Tried Lightning Piggy on ESP32, but micropython was beyond my AI-vibe coding skills. Then came the crazy idea: merge Bitchat with Cashu. Why? So kids could use their balance at the coffeeshop offline. Cashu tokens are bearer instruments. As long as the POS is online, they clear."
        },
        {
          "title": "Birth of Bitpoints.me",
          "body": "After some effort, I merged bitchat-android with cashu.me, and that's how Bitpoints.me was born. A Bitcoin-native rewards system that's interoperable with Lightning, has familiar UX (points/gift cards), is educational for pre-coiners, and is community-first, not corporate."
        },
        {
          "title": "What's Next",
          "body": "This is just the beginning. If you're building, curious, or want to bring sats to your local community, let's connect. Bitpoints.me represents a new model for rewards systems—one that educates, empowers, and creates real value for users while supporting the Bitcoin ecosystem."
        }
      ],
      "meta": {
        "title": "Introducing Bitpoints.me – A Bitcoin-native rewards system | Builder Vancouver",
        "description": "JP presents Bitpoints.me, a Bitcoin-native rewards system that transforms traditional loyalty points into sats, teaching people about Bitcoin through familiar UX patterns.",
        "keywords": [
          "bitpoints",
          "cashu",
          "bitcoin rewards",
          "lightning network",
          "bitcoin education",
          "loyalty points",
          "bitcoin native",
          "bitchat"
        ]
      }
    },
    {
      "id": "presentation-lightning-integration-options",
      "title": "Lightning Integration: Understanding Your Options",
      "slug": "lightning-integration-options",
      "description": "An overview of Lightning integration approaches - comparing Spark and self-sovereign Lightning for developers building Bitcoin payment apps.",
      "overview": "Running a full Lightning node has operational complexity that many apps don't need. This presentation explores two approaches to Lightning integration: Spark (self-custodial with simplified developer experience) and self-sovereign Lightning (full node operation). Learn the tradeoffs in trust models, developer experience, and operational complexity.",
      "presenterId": "presenter-eric-chennels",
      "date": "2024-12-09",
      "duration": "10-15 minutes",
      "links": [
        {
          "text": "Lightning 101",
          "url": "/lightning-101",
          "external": false
        },
        {
          "text": "Layer 2 Overview",
          "url": "/layer-2-overview",
          "external": false
        },
        {
          "text": "Spark Soundboard Demo",
          "url": "https://github.com/echennells/spark-soundboard/",
          "external": true
        }
      ],
      "sections": [
        {
          "title": "The Problem: Bitcoin L1 Doesn't Work for Payments",
          "body": "Bitcoin's base layer (L1) has significant limitations for everyday payments:\n\n• High fees during congestion (can exceed payment value for small transactions)\n• Slow confirmation times (10+ minutes average, sometimes hours)\n• Poor merchant acceptance for L1 (most want instant finality)\n• Impractical for low-value payments (fees often higher than payment amount)\n• Difficult to scale globally (7 transactions per second maximum)\n\nThese constraints make Bitcoin L1 unsuitable for point-of-sale, streaming payments, or micropayments. This is why Lightning Network was created."
        },
        {
          "title": "Lightning Network: The Power and the Complexity",
          "body": "Lightning Network solves Bitcoin's payment limitations with instant, low-fee transactions. However, being a full peer in the Lightning network comes with operational complexity:\n\n• Funds at risk if data not secured and backed up properly\n• Liveliness requirements - node must be online to accept payments and maintain security\n• Channel liquidity management - balancing inbound/outbound capacity\n• Channel opening/closing costs - on-chain fees required\n• Technical knowledge required - understanding routing, watchtowers, backups\n\nFor many applications and developers, this complexity is a barrier to adoption.",
          "links": [
            {
              "text": "Lightning 101 Guide",
              "url": "/lightning-101",
              "external": false
            }
          ]
        },
        {
          "title": "Lightning as an Interoperability Layer",
          "body": "Lightning is evolving beyond just a payment network - it's becoming an interoperability layer for Bitcoin ecosystem protocols. Several newer approaches use Lightning for settlement while offering different developer experiences and trust models.\n\nThis is why alternatives like Spark are emerging: they abstract away Lightning's operational complexity while maintaining interoperability with the broader Lightning network. You can receive payments from any Lightning wallet, but you don't have to manage channels yourself.\n\nThese protocols don't require running your own node or managing channels, but they involve different trust models and tradeoffs."
        },
        {
          "title": "Two Lightning Integration Approaches",
          "body": "There are two main approaches to integrating Lightning payments, each with different trust models and tradeoffs:\n\n**Spark**\nSelf-custodial Lightning with simplified developer experience. Different trust model than running your own node - you don't manage channels or liquidity yourself. Has swap fees. Works for production.\n\n**Self-Sovereign Lightning**\nRun your own Lightning node. You control everything: channels, keys, liquidity, backups. Complex to operate but fully sovereign.\n\nPick based on what trust model works for your app and users."
        }
      ],
      "meta": {
        "title": "Lightning Integration: Understanding Your Options | Builder Vancouver",
        "description": "Compare Lightning integration approaches: Spark vs self-sovereign Lightning. Learn the tradeoffs for Bitcoin payment apps.",
        "keywords": [
          "lightning network",
          "spark",
          "bitcoin payments",
          "lightning integration",
          "bitcoin layer 2",
          "self-sovereign lightning"
        ]
      }
    },
    {
      "id": "presentation-building-lightning-spark",
      "title": "Building Lightning Payments with Spark",
      "slug": "building-lightning-spark",
      "description": "A hands-on developer demo showing how to integrate Lightning payments using Spark - featuring the Spark Soundboard demo app.",
      "overview": "Want to add Lightning payments to your app but don't want to run a node? This presentation demonstrates integrating Lightning payments using Spark, a developer-friendly protocol that abstracts away channel management and node operation. We'll walk through the Spark Soundboard demo app, showing real code and integration patterns to get you building quickly.",
      "presenterId": "presenter-eric-chennels",
      "date": "2024-12-09",
      "duration": "10-15 minutes",
      "links": [
        {
          "text": "Spark Soundboard GitHub",
          "url": "https://github.com/echennells/spark-soundboard/",
          "external": true
        },
        {
          "text": "Lightning Integration Options",
          "url": "/presentations/lightning-integration-options",
          "external": false
        },
        {
          "text": "Lightning 101",
          "url": "/lightning-101",
          "external": false
        }
      ],
      "sections": [
        {
          "title": "Why Spark for Lightning Integration?",
          "body": "Most developers want to add Lightning payments without becoming Lightning experts. Spark provides:\n\n• Simple API - no channel management, no liquidity concerns\n• Fast integration - from zero to Lightning payments in minutes\n• Lower barrier to entry - no node operation required\n• Focus on app logic - not Lightning network topology\n\nTradeoff: You're using a custodial service (Spark holds the Lightning channels), which means different trust model than self-custody. For prototypes, MVPs, and learning - this is often the right choice."
        },
        {
          "title": "Understanding Lightning Invoices",
          "body": "Lightning invoices are the foundation of Lightning payments. Key concepts:\n\n• Can have an amount specified, or be amount-flexible\n• Can't be overpaid or underpaid if amount is fixed\n• Some types can only be paid once (single-use)\n• Some can be paid multiple times (reusable)\n• Can be used to push money to the person who scans the invoice\n• Invoices encode: payment amount, destination, description, expiry\n\nSpark abstracts much of this complexity while still giving you control over invoice creation and payment verification."
        },
        {
          "title": "Demo: Spark Soundboard Architecture",
          "body": "The Spark Soundboard is a Lightning-enabled soundboard that charges 100 sats per sound effect:\n\n**User Flow:**\n1. User clicks a sound button (airhorn, drumroll, tada, or crickets)\n2. Backend creates Lightning invoice using Spark SDK\n3. QR code modal appears with the invoice\n4. User pays with any Lightning wallet\n5. Backend polls wallet transfers every 3 seconds to detect payment\n6. Frontend polls payment status every second\n7. When payment confirmed, sound plays automatically\n\n**Tech Stack:**\n• Node.js + Express backend\n• Vanilla HTML/CSS/JavaScript frontend\n• @buildonspark/spark-sdk for wallet and invoices\n• qrcodejs for QR code generation\n• In-memory payment tracking (Map)\n\nNo login required, no database needed - just Lightning payments and sound effects.",
          "links": [
            {
              "text": "View Code on GitHub",
              "url": "https://github.com/echennells/spark-soundboard/",
              "external": true
            }
          ]
        },
        {
          "title": "Code Walkthrough: How It Actually Works",
          "body": "The Spark Soundboard demonstrates a complete Lightning payment flow:\n\n**Backend (Node.js + Express):**\n• Initialize Spark wallet using @buildonspark/spark-sdk\n• Create Lightning invoices via sparkWallet.createLightningInvoice()\n• Poll for payment confirmation by checking wallet transfers every 3 seconds\n• Store pending payments in-memory (Map)\n• Serve static frontend files\n\n**Frontend (Vanilla HTML/CSS/JS):**\n• Display sound buttons (airhorn, drumroll, tada, crickets)\n• Generate QR code for invoice using qrcodejs library\n• Poll backend for payment status\n• Auto-play sound when payment confirmed\n\n**Key Integration Points:**\n1. Wallet initialization with mnemonic phrase\n2. Invoice creation (100 sats per sound)\n3. Payment monitoring via sparkWallet.getTransfers()\n4. Payment status polling (frontend checks every second)\n\nCheck the GitHub repo for the complete source code."
        },
        {
          "title": "Getting Started with Spark",
          "body": "Ready to integrate Lightning payments with Spark?\n\n1. Review the Spark Soundboard code for real-world examples\n2. Check Spark documentation for API details and SDK setup\n3. Start with a simple proof-of-concept in your app\n4. Test with small amounts on testnet first\n5. Iterate and refine based on user feedback\n\nRemember: Spark is one tool in the Lightning ecosystem. As you grow, you can migrate to self-custody Lightning if needed. Start simple, ship fast, and learn as you build.",
          "links": [
            {
              "text": "Spark Soundboard Demo",
              "url": "https://github.com/echennells/spark-soundboard/",
              "external": true
            }
          ]
        }
      ],
      "meta": {
        "title": "Building Lightning Payments with Spark | Builder Vancouver",
        "description": "Hands-on developer demo showing how to integrate Lightning payments using Spark. Features the Spark Soundboard demo app with real code examples.",
        "keywords": [
          "spark",
          "lightning network",
          "lightning payments",
          "bitcoin development",
          "lightning integration",
          "demo app",
          "spark soundboard"
        ]
      }
    }
  ]
}
